Data/Section 5/5.1/Clients/VM2_Intance2/rep3/output_C2_T1_W64_K6_R3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       42014 ops,     488 (avg:     466) ops/sec, 1.74MB/sec (avg: 1.66MB/sec),  4.07 (avg:  4.27) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         233.42          ---          ---      4.10600       242.40
Gets         233.40      1400.38         0.00      4.43300      1457.07
Waits          0.00          ---          ---      0.00000          ---
Totals       466.82      1400.38         0.00      4.26900      1699.47


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.01
SET       1.200         0.03
SET       1.300         0.17
SET       1.400         0.79
SET       1.500         2.13
SET       1.600         4.23
SET       1.700         6.91
SET       1.800        10.30
SET       1.900        13.90
SET       2.000        17.76
SET       2.100        21.67
SET       2.200        25.40
SET       2.300        28.73
SET       2.400        31.76
SET       2.500        34.40
SET       2.600        36.98
SET       2.700        39.43
SET       2.800        41.57
SET       2.900        43.48
SET       3.000        45.30
SET       3.100        46.94
SET       3.200        48.55
SET       3.300        50.16
SET       3.400        51.66
SET       3.500        53.04
SET       3.600        54.45
SET       3.700        55.74
SET       3.800        56.91
SET       3.900        58.06
SET       4.000        59.40
SET       4.100        60.60
SET       4.200        61.85
SET       4.300        63.12
SET       4.400        64.33
SET       4.500        65.54
SET       4.600        66.77
SET       4.700        67.94
SET       4.800        69.42
SET       4.900        70.81
SET       5.000        72.20
SET       5.100        73.52
SET       5.200        74.84
SET       5.300        76.04
SET       5.400        77.31
SET       5.500        78.50
SET       5.600        79.77
SET       5.700        80.82
SET       5.800        81.82
SET       5.900        82.80
SET       6.000        83.82
SET       6.100        84.84
SET       6.200        85.74
SET       6.300        86.46
SET       6.400        87.19
SET       6.500        87.85
SET       6.600        88.44
SET       6.700        88.92
SET       6.800        89.45
SET       6.900        89.96
SET       7.000        90.47
SET       7.100        90.95
SET       7.200        91.31
SET       7.300        91.62
SET       7.400        91.98
SET       7.500        92.37
SET       7.600        92.68
SET       7.700        92.93
SET       7.800        93.20
SET       7.900        93.47
SET       8.000        93.77
SET       8.100        94.00
SET       8.200        94.18
SET       8.300        94.40
SET       8.400        94.65
SET       8.500        94.86
SET       8.600        95.07
SET       8.700        95.26
SET       8.800        95.50
SET       8.900        95.67
SET       9.000        95.83
SET       9.100        96.02
SET       9.200        96.18
SET       9.300        96.30
SET       9.400        96.46
SET       9.500        96.63
SET       9.600        96.78
SET       9.700        96.94
SET       9.800        97.02
SET       9.900        97.15
SET      10.000        97.63
SET      11.000        98.24
SET      12.000        98.58
SET      13.000        98.90
SET      14.000        99.14
SET      15.000        99.37
SET      16.000        99.49
SET      17.000        99.62
SET      18.000        99.71
SET      19.000        99.75
SET      20.000        99.78
SET      21.000        99.81
SET      22.000        99.87
SET      23.000        99.89
SET      24.000        99.90
SET      25.000        99.90
SET      26.000        99.91
SET      27.000        99.92
SET      28.000        99.92
SET      29.000        99.93
SET      30.000        99.93
SET      31.000        99.94
SET      32.000        99.95
SET      33.000        99.96
SET      35.000        99.96
SET      37.000        99.97
SET      39.000        99.97
SET      40.000        99.98
SET      60.000        99.98
SET      73.000        99.99
SET      85.000        99.99
SET      87.000       100.00
---
GET       1.500         0.03
GET       1.600         0.24
GET       1.700         0.73
GET       1.800         1.90
GET       1.900         3.59
GET       2.000         6.05
GET       2.100         8.97
GET       2.200        12.60
GET       2.300        16.18
GET       2.400        20.03
GET       2.500        23.99
GET       2.600        27.97
GET       2.700        31.39
GET       2.800        34.53
GET       2.900        37.28
GET       3.000        39.66
GET       3.100        42.10
GET       3.200        44.02
GET       3.300        45.87
GET       3.400        47.62
GET       3.500        49.18
GET       3.600        50.65
GET       3.700        51.98
GET       3.800        53.10
GET       3.900        54.36
GET       4.000        55.63
GET       4.100        56.76
GET       4.200        57.93
GET       4.300        59.01
GET       4.400        60.15
GET       4.500        61.10
GET       4.600        62.27
GET       4.700        63.40
GET       4.800        64.64
GET       4.900        65.82
GET       5.000        67.14
GET       5.100        68.44
GET       5.200        69.89
GET       5.300        71.27
GET       5.400        72.64
GET       5.500        73.92
GET       5.600        75.30
GET       5.700        76.67
GET       5.800        77.94
GET       5.900        79.13
GET       6.000        80.30
GET       6.100        81.46
GET       6.200        82.50
GET       6.300        83.51
GET       6.400        84.36
GET       6.500        85.21
GET       6.600        86.08
GET       6.700        86.87
GET       6.800        87.52
GET       6.900        88.17
GET       7.000        88.75
GET       7.100        89.29
GET       7.200        89.80
GET       7.300        90.27
GET       7.400        90.66
GET       7.500        91.02
GET       7.600        91.43
GET       7.700        91.79
GET       7.800        92.20
GET       7.900        92.55
GET       8.000        92.87
GET       8.100        93.14
GET       8.200        93.37
GET       8.300        93.70
GET       8.400        93.97
GET       8.500        94.22
GET       8.600        94.50
GET       8.700        94.66
GET       8.800        94.93
GET       8.900        95.12
GET       9.000        95.36
GET       9.100        95.53
GET       9.200        95.68
GET       9.300        95.89
GET       9.400        96.09
GET       9.500        96.22
GET       9.600        96.42
GET       9.700        96.58
GET       9.800        96.69
GET       9.900        96.78
GET      10.000        97.40
GET      11.000        98.18
GET      12.000        98.64
GET      13.000        98.90
GET      14.000        99.16
GET      15.000        99.34
GET      16.000        99.44
GET      17.000        99.51
GET      18.000        99.58
GET      19.000        99.64
GET      20.000        99.71
GET      21.000        99.74
GET      22.000        99.78
GET      23.000        99.82
GET      24.000        99.85
GET      25.000        99.89
GET      26.000        99.90
GET      27.000        99.90
GET      29.000        99.91
GET      30.000        99.91
GET      32.000        99.92
GET      33.000        99.93
GET      34.000        99.93
GET      35.000        99.94
GET      38.000        99.95
GET      41.000        99.97
GET      52.000        99.97
GET      54.000        99.98
GET      55.000        99.99
GET      56.000        99.99
GET      63.000       100.00
GET      91.000       100.00
---